"""
### 3.3.1. Задача 1: "Трансформация матриц в numpy"

Создайте две матрицы по формулам,
воспользовавшись типом «numpy.array(some_list)» и
командой «numpy.fromfunction(function)», для них вычислите:

- Вычислите Aᵀ и Bᵀ;
- Вычислите A + B;
- Вычислите A - B;
- Вычислите A * B и B * A;
- Вычислите A / B и B / A;
- Вычислите A // B и B // A;
- Вычислите A⁻¹ и B⁻¹;
- Вычислите A * B⁻¹ и B * A⁻¹;
- Вычислите значение 2Aᵀ - E, где E — единичная матрица, размера MxN, при том,
что изначально матрица A имеет размер NxM.
- Вычислите значение многочлена 𝑓(𝑥) = 𝑥³ − 7𝑥² + 13𝑥 − 5, если 𝑥 — это матрицы A и B;
- Вычислите значения функции 1 и функции 2 из Таблицы 2 для матриц A и B;
- Вычислите значения функции 3 из Таблицы 2, приняв что переменная
«у» — это матрица A, а переменная «𝑥𝑥» — это матрица B;

При этом учтите, что здесь знак «*» обозначает матричное умножение,
а не поэлементное.
"""
# -*- coding: utf-8 -*-